In [124]:
%load_ext autoreload
%autoreload 2

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

## Evaluation Criteria
- The import of data into the database should work correctly
- The implemented functionality/queries should work correctly as desribed by problem text
- The implemented functionality/queries should be clear and easy to understand
- The efficiency of the code is not considered as an evaluation criteria in this exercise
- The connection to programming language should be clear and easy to understand
- The code should be implemented by the group members and for this exercise, i.e. copying code from
  others or by the use of AI tools (CoPilot, ChatGPT and similar) is considered as cheating
- Clear and understandable report as described by the problem text

In [127]:
import database

In [128]:
db_conn = database.CustomDbConnector()

You are connected to the database: mongo
-----------------------------------------------

## Part 1, import

In [129]:
import importer
import pymongo

In [130]:
imprt = importer.Importer(db_conn.db)

In [146]:
imprt.drop_collections()

In [147]:
imprt.import_with_backreferences()

----------------------Starting import_with_backreferences-----------------------
----------------------------Starting import_user_df-----------------------------
----------------------Finished import_user_df in 29.753 ms----------------------

-----------------Starting import_activities_and_track_points_df-----------------

/Users/larswaage/Code/large-distributed-data/src/mongodb/importer.py:156: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df = pd.read_csv(

--------Finished import_activities_and_track_points_df in 101588.501 ms---------

Importing users
Importing activities
Importing track points
Creating spatial index for location on db.track_points
Finished creating index
--------------Finished import_with_backreferences in 430656.439 ms--------------

### Samples

In [148]:
imprt.user_sample()

   _id  has_labels                                         activities
0    0       False  [6539021027d6a08c757a79a0, 6539021027d6a08c757...
1    1       False  [6539021227d6a08c757a7a3b, 6539021227d6a08c757...
2    2       False  [6539021227d6a08c757a7a74, 6539021227d6a08c757...
3    3       False  [6539021327d6a08c757a7b06, 6539021327d6a08c757...
4    4       False  [6539021427d6a08c757a7c0b, 6539021427d6a08c757...
5    5       False  [6539021627d6a08c757a7d65, 6539021627d6a08c757...
6    6       False  [6539021627d6a08c757a7dae, 6539021627d6a08c757...
7    7       False  [6539021627d6a08c757a7dc6, 6539021627d6a08c757...
8    8       False  [6539021727d6a08c757a7dee, 6539021727d6a08c757...
9    9       False  [6539021727d6a08c757a7e05, 6539021727d6a08c757...

In [149]:
imprt.activity_sample()

,_id,user_id,start_datetime,end_datetime,transportation_mode,track_points
0,6539021027d6a08c757a79a0,0,2009-04-12 07:33:03,2009-04-12 17:24:59,,"[6539028c27d6a08c757ab850, 6539028c27d6a08c757..."
1,6539021027d6a08c757a79a1,0,2009-05-10 02:02:06,2009-05-10 06:20:11,,"[6539028c27d6a08c757abf2a, 6539028c27d6a08c757..."
2,6539021027d6a08c757a79a2,0,2008-12-01 11:18:27,2008-12-01 11:35:15,,"[6539028c27d6a08c757ac25b, 6539028c27d6a08c757..."
3,6539021027d6a08c757a79a3,0,2009-06-21 10:14:07,2009-06-21 14:47:12,,"[6539028c27d6a08c757ac312, 6539028c27d6a08c757..."
4,6539021027d6a08c757a79a4,0,2008-12-11 12:14:32,2008-12-11 12:24:32,,"[6539028c27d6a08c757aca5a, 6539028c27d6a08c757..."
5,6539021027d6a08c757a79a5,0,2009-06-29 01:16:30,2009-06-29 11:13:12,,"[6539028c27d6a08c757acad3, 6539028c27d6a08c757..."
6,6539021027d6a08c757a79a6,0,2009-05-09 18:16:36,2009-05-09 18:30:36,,"[6539028c27d6a08c757ad295, 6539028c27d6a08c757..."
7,6539021027d6a08c757a79a7,0,2009-07-03 00:28:00,2009-07-03 08:37:23,,"[6539028c27d6a08c757ad342, 6539028c27d6a08c757..."
8,6539021027d6a08c757a79a8,0,2009-06-07 07:52:55,2009-06-07 09:46:03,,"[6539028c27d6a08c757ada3e, 6539028c27d6a08c757..."
9,6539021027d6a08c757a79a9,0,2009-06-11 22:12:04,2009-06-11 22:34:54,,"[6539028c27d6a08c757adcc4, 6539028c27d6a08c757..."

In [150]:
imprt.track_point_sample()

,_id,datetime,latitude,longitude,altitude,location,activity_id,user_id
0,6539028c27d6a08c757ab850,2009-04-12 07:33:03,40.000017,116.327479,105.0,"{'type': 'Point', 'coordinates': [116.327479, ...",6539021027d6a08c757a79a0,000
1,6539028c27d6a08c757ab851,2009-04-12 07:33:09,40.000168,116.327474,80.0,"{'type': 'Point', 'coordinates': [116.327474, ...",6539021027d6a08c757a79a0,000
2,6539028c27d6a08c757ab852,2009-04-12 07:33:14,40.000055,116.327454,99.0,"{'type': 'Point', 'coordinates': [116.327454, ...",6539021027d6a08c757a79a0,000
3,6539028c27d6a08c757ab853,2009-04-12 07:33:19,40.000021,116.327407,109.0,"{'type': 'Point', 'coordinates': [116.327407, ...",6539021027d6a08c757a79a0,000
4,6539028c27d6a08c757ab854,2009-04-12 07:33:24,40.000035,116.327281,111.0,"{'type': 'Point', 'coordinates': [116.327281, ...",6539021027d6a08c757a79a0,000
5,6539028c27d6a08c757ab855,2009-04-12 07:33:29,39.999983,116.327285,114.0,"{'type': 'Point', 'coordinates': [116.327285, ...",6539021027d6a08c757a79a0,000
6,6539028c27d6a08c757ab856,2009-04-12 07:33:34,39.999853,116.327267,120.0,"{'type': 'Point', 'coordinates': [116.327267, ...",6539021027d6a08c757a79a0,000
7,6539028c27d6a08c757ab857,2009-04-12 07:33:39,39.999745,116.327165,125.0,"{'type': 'Point', 'coordinates': [116.327165, ...",6539021027d6a08c757a79a0,000
8,6539028c27d6a08c757ab858,2009-04-12 07:33:44,39.999661,116.326997,126.0,"{'type': 'Point', 'coordinates': [116.326997, ...",6539021027d6a08c757a79a0,000
9,6539028c27d6a08c757ab859,2009-04-12 07:33:49,39.999528,116.326873,127.0,"{'type': 'Point', 'coordinates': [116.326873, ...",6539021027d6a08c757a79a0,000

## Part 2, tasks

### Setup

In [151]:
import tasks
task = tasks.Task(db_conn.db)

### Task 1

In [152]:
t1 = task.task1()
t1

---------------------------------Starting task1---------------------------------
-------------------------Finished task1 in 6350.366 ms--------------------------

   # users  # activities  # track points
0      182         16048         9681756

### Task 2

In [153]:
t2 = task.task2()
t2

---------------------------------Starting task2---------------------------------
--------------------------Finished task2 in 17.345 ms---------------------------

   min_activity_count  max_activity_count  avg_activity_count
0                   0                2102           88.175824

### Task 3

In [154]:
t3 = task.task3()
t3

---------------------------------Starting task3---------------------------------
---------------------------Finished task3 in 4.557 ms---------------------------

    _id  activity_count
0   128            2102
1   153            1793
2    25             715
3   163             704
4    62             691
5   144             563
6    41             399
7    85             364
8     4             346
9   140             345
10  167             320
11   68             280
12   17             265
13    3             261
14   14             236
15  126             215
16   30             210
17  112             208
18   11             201
19   39             198

### Task 4

In [155]:
t4 = task.task4()
t4

---------------------------------Starting task4---------------------------------
--------------------------Finished task4 in 70.755 ms---------------------------

   Users Who Have Taken a Taxi
0                           10
1                           58
2                           62
3                           78
4                           80
5                           85
6                           98
7                          111
8                          128
9                          163

### Task 5

In [156]:
t5 = task.task5()
t5

---------------------------------Starting task5---------------------------------
--------------------------Finished task5 in 15.471 ms---------------------------

        _id  transportation_mode_count
0      walk                        481
1       car                        419
2      bike                        262
3       bus                        199
4    subway                        133
5      taxi                         37
6  airplane                          3
7     train                          2
8      boat                          1
9       run                          1

### Task 6

#### Task 6a

In [206]:
t6a = task.task6a()
t6a

--------------------------------Starting task6a---------------------------------
-------------------------Finished task6a in 554.623 ms--------------------------

   activityCount  year
0           5895  2008

#### Task 6b

In [207]:
t6b = task.task6b()
t6b

     totalHours  year
0  11612.423889  2009

### Task 10

In [205]:
t10 = task.task10(_type="box")
t10

--------------------------------Starting task10---------------------------------
-------------------------Finished task10 in 6488.486 ms-------------------------

      0
0   004
1   018
2   019
3   025
4   052
5   062
6   067
7   112
8   119
9   128
10  131
11  136
12  140
13  144
14  153
15  163
16  168
17  169

### Task 11

In [196]:
t11 = task.task11()
t11

--------------------------------Starting task11---------------------------------
-------------------------Finished task11 in 736.733 ms--------------------------

    user_id most_used_transportation_mode  transportation_mode_count
0        10                           bus                          3
1        20                          walk                         80
2        21                          walk                          1
3        52                           bus                          1
4        56                          bike                         15
5        58                          walk                          2
6        60                          walk                          1
7        62                          taxi                        173
8        64                          bike                          1
9        65                          bike                         10
10       67                          walk                          1
11       69                          bike                          1
12       73                          walk                         52
13       75                          walk                          1
14       76                           car                          3
15       78                          taxi                         37
16       80                          bike                          1
17       81                          walk                          4
18       82                          walk                          2
19       84                          walk                          9
20       85                           bus                         18
21       86                           car                          2
22       87                          walk                          5
23       89                           car                          7
24       91                           bus                          2
25       92                          walk                          1
26       97                          bike                          9
27       98                          taxi                          1
28      101                           car                          3
29      102                          walk                          7
30      107                          walk                          1
31      108                          walk                          2
32      111                          taxi                          3
33      112                           bus                         69
34      115                           car                         80
35      117                          walk                          1
36      125                          bike                          3
37      126                          walk                         13
38      128                        subway                        312
39      136                          walk                          3
40      138                          bike                          2
41      139                          bike                          4
42      144                          walk                          2
43      153                          walk                          5
44      161                          walk                          1
45      163                          taxi                         26
46      167                          bike                         31
47      175                           bus                          1